Repository: apoorvdarshan/fud-ai
Catalog: ios/calorietracker/AIErrorMessages.xcstrings
Source language: en
Languages: es, tr, uk

# ai.error.no_key
source: No API key configured. Add your key in Settings → AI Provider.
es: No hay ninguna clave API configurada. Añade tu clave en Ajustes → Proveedor de IA.
tr: API anahtarı yapılandırılmadı. Anahtarınızı Ayarlar → Yapay Zeka Sağlayıcısı'ndan ekleyin.
uk: Ключ API не налаштовано. Додайте ключ у Налаштування → Провайдер ШІ.

# ai.error.image_conversion
source: Failed to process the image. Try another photo.
es: No se pudo procesar la imagen. Prueba con otra foto.
tr: Görsel işlenemedi. Başka bir fotoğraf deneyin.
uk: Не вдалося обробити зображення. Спробуйте інше фото.

# ai.error.invalid_response
source: Could not understand the AI response. Please try again.
es: No se pudo entender la respuesta de la IA. Inténtalo de nuevo.
tr: Yapay zeka yanıtı anlaşılamadı. Lütfen tekrar deneyin.
uk: Не вдалося розібрати відповідь ШІ. Спробуйте ще раз.

# ai.error.invalid_url
source: Invalid API URL. Check your provider settings.
es: URL de la API no válida. Revisa los ajustes de tu proveedor.
tr: Geçersiz API URL'si. Sağlayıcı ayarlarınızı kontrol edin.
uk: Недійсна URL-адреса API. Перевірте налаштування провайдера.

# ai.error.offline
source: You appear to be offline. Check your connection and try again.
es: Parece que no tienes conexión. Revisa tu conexión e inténtalo de nuevo.
tr: Çevrimdışı görünüyorsunuz. Bağlantınızı kontrol edip tekrar deneyin.
uk: Схоже, ви офлайн. Перевірте з'єднання та спробуйте ще раз.

# ai.error.connection
source: Could not connect to the AI provider. Check your connection and provider URL, then try again.
es: No se pudo conectar con el proveedor de IA. Revisa tu conexión y la URL del proveedor, e inténtalo de nuevo.
tr: Yapay zeka sağlayıcısına bağlanılamadı. Bağlantınızı ve sağlayıcı URL'nizi kontrol edip tekrar deneyin.
uk: Не вдалося підключитися до провайдера ШІ. Перевірте з'єднання та URL провайдера, потім спробуйте ще раз.

# ai.error.timeout
source: The AI took too long to respond. Try again, or raise the request timeout in Settings → AI Provider.
es: La IA tardó demasiado en responder. Inténtalo de nuevo o aumenta el tiempo de espera de la solicitud en Ajustes → Proveedor de IA.
tr: Yapay zeka yanıt vermek için çok uzun sürdü. Tekrar deneyin veya Ayarlar → Yapay Zeka Sağlayıcısı'ndan istek zaman aşımını artırın.
uk: ШІ занадто довго відповідав. Спробуйте ще раз або збільште тайм-аут запиту в Налаштування → Провайдер ШІ.

# ai.error.credits
source: Your AI account is out of credits. Top up, or switch provider in Settings → AI Provider.
es: Tu cuenta de IA se quedó sin créditos. Recarga saldo o cambia de proveedor en Ajustes → Proveedor de IA.
tr: Yapay zeka hesabınızın kredisi bitti. Kredi yükleyin veya Ayarlar → Yapay Zeka Sağlayıcısı'ndan sağlayıcı değiştirin.
uk: На вашому обліковому записі ШІ закінчилися кредити. Поповніть баланс або змініть провайдера в Налаштування → Провайдер ШІ.

# ai.error.daily_quota
source: Your AI account’s daily quota is used up. Try again tomorrow, or switch provider in Settings → AI Provider.
es: Se agotó la cuota diaria de tu cuenta de IA. Inténtalo de nuevo mañana o cambia de proveedor en Ajustes → Proveedor de IA.
tr: Yapay zeka hesabınızın günlük kotası doldu. Yarın tekrar deneyin veya Ayarlar → Yapay Zeka Sağlayıcısı'ndan sağlayıcı değiştirin.
uk: Щоденну квоту вашого облікового запису ШІ вичерпано. Спробуйте завтра або змініть провайдера в Налаштування → Провайдер ШІ.

# ai.error.quota
source: Your AI account’s usage quota was exceeded. Check your provider’s limits, or switch provider in Settings → AI Provider.
es: Se superó la cuota de uso de tu cuenta de IA. Revisa los límites de tu proveedor o cambia de proveedor en Ajustes → Proveedor de IA.
tr: Yapay zeka hesabınızın kullanım kotası aşıldı. Sağlayıcınızın sınırlarını kontrol edin veya Ayarlar → Yapay Zeka Sağlayıcısı'ndan sağlayıcı değiştirin.
uk: Перевищено квоту використання вашого облікового запису ШІ. Перевірте ліміти провайдера або змініть провайдера в Налаштування → Провайдер ШІ.

# ai.error.model
source: The selected model or API endpoint is unavailable. Check the model and API URL in Settings → AI Provider.
es: El modelo o el endpoint de la API seleccionado no está disponible. Revisa el modelo y la URL de la API en Ajustes → Proveedor de IA.
tr: Seçilen model veya API uç noktası kullanılamıyor. Ayarlar → Yapay Zeka Sağlayıcısı'ndan modeli ve API URL'sini kontrol edin.
uk: Обрана модель або кінцева точка API недоступна. Перевірте модель і URL API в Налаштування → Провайдер ШІ.

# ai.error.rate_limit
source: Rate limit hit on your API key. Wait a minute, or switch provider in Settings → AI Provider. If you use a free tier, check whether its daily quota is used up.
es: Se alcanzó el límite de solicitudes de tu clave API. Espera un minuto o cambia de proveedor en Ajustes → Proveedor de IA. Si usas un plan gratuito, comprueba si se agotó su cuota diaria.
tr: API anahtarınızda hız sınırına ulaşıldı. Bir dakika bekleyin veya Ayarlar → Yapay Zeka Sağlayıcısı'ndan sağlayıcı değiştirin. Ücretsiz katman kullanıyorsanız günlük kotasının dolup dolmadığını kontrol edin.
uk: Досягнуто ліміт запитів для вашого ключа API. Зачекайте хвилину або змініть провайдера в Налаштування → Провайдер ШІ. Якщо ви використовуєте безкоштовний тариф, перевірте, чи не вичерпано щоденну квоту.

# ai.error.key_rejected
source: Your API key was rejected. Open Settings → AI Provider and re-paste a valid key.
es: Tu clave API fue rechazada. Abre Ajustes → Proveedor de IA y vuelve a pegar una clave válida.
tr: API anahtarınız reddedildi. Ayarlar → Yapay Zeka Sağlayıcısı'nı açın ve geçerli bir anahtarı yeniden yapıştırın.
uk: Ваш ключ API відхилено. Відкрийте Налаштування → Провайдер ШІ і вставте дійсний ключ.

# ai.error.overloaded
source: The AI provider is overloaded right now. We retried a few times — try again in a minute, or switch provider/model in Settings → AI Provider.
es: El proveedor de IA está saturado en este momento. Lo reintentamos varias veces; inténtalo de nuevo en un minuto o cambia de proveedor o modelo en Ajustes → Proveedor de IA.
tr: Yapay zeka sağlayıcısı şu anda aşırı yüklü. Birkaç kez yeniden denedik — bir dakika sonra tekrar deneyin veya Ayarlar → Yapay Zeka Sağlayıcısı'ndan sağlayıcı/model değiştirin.
uk: Провайдер ШІ зараз перевантажений. Ми повторили кілька разів — спробуйте через хвилину або змініть провайдера/модель у Налаштування → Провайдер ШІ.

# ai.error.generic
source: The AI request failed. Try again, or switch provider in Settings → AI Provider.
es: La solicitud a la IA falló. Inténtalo de nuevo o cambia de proveedor en Ajustes → Proveedor de IA.
tr: Yapay zeka isteği başarısız oldu. Tekrar deneyin veya Ayarlar → Yapay Zeka Sağlayıcısı'ndan sağlayıcı değiştirin.
uk: Запит до ШІ не вдався. Спробуйте ще раз або змініть провайдера в Налаштування → Провайдер ШІ.

# ai.error.local_unavailable
source: The on-device AI runtime is unavailable. Check the downloaded model in Settings → AI Provider.
es: El motor de IA en el dispositivo no está disponible. Revisa el modelo descargado en Ajustes → Proveedor de IA.
tr: Cihaz üzerindeki yapay zeka çalışma zamanı kullanılamıyor. Ayarlar → Yapay Zeka Sağlayıcısı'ndan indirilen modeli kontrol edin.
uk: Локальне середовище ШІ недоступне. Перевірте завантажену модель у Налаштування → Провайдер ШІ.

# ai.error.unsupported_device
source: Apple Intelligence requires iOS 26 or later on a supported iPhone.
es: Apple Intelligence requiere iOS 26 o posterior en un iPhone compatible.
tr: Apple Intelligence, desteklenen bir iPhone'da iOS 26 veya üzerini gerektirir.
uk: Apple Intelligence потребує iOS 26 або новішої версії на підтримуваному iPhone.

# ai.error.truncated
source: The AI response was truncated twice. Try a shorter input or another model.
es: La respuesta de la IA se cortó dos veces. Prueba con un texto más corto o con otro modelo.
tr: Yapay zeka yanıtı iki kez kesildi. Daha kısa bir girdi veya başka bir model deneyin.
uk: Відповідь ШІ двічі обрізано. Спробуйте коротший ввід або іншу модель.

# ai.error.text_only
source: Apple Intelligence is available for text-only requests.
es: Apple Intelligence solo está disponible para solicitudes de texto.
tr: Apple Intelligence yalnızca metin içeren istekler için kullanılabilir.
uk: Apple Intelligence доступний для запитів лише з текстом.

# ai.error.both_failed
source: %1$@ and fallback %2$@ both failed. %3$@
es: Fallaron %1$@ y el respaldo %2$@. %3$@
tr: %1$@ ve yedek %2$@ ikisi de başarısız oldu. %3$@
uk: %1$@ і резервний %2$@ не спрацювали. %3$@
